Revit 2024 API
WallCrossSection Enumeration
 The allowed values for the WALL_CROSS_SECTION parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WallCrossSection
Visual Basic
Public Enumeration WallCrossSection
Visual C++
public enum class WallCrossSection
Members
Member name | Description
SingleSlanted |  A single-slanted wall whose angle is controlled by the parameter WALL_SINGLE_SLANT_ANGLE_FROM_VERTICAL.
Vertical |  A vertical wall, 0 degrees.
Tapered |  A tapered wall whose angle is controlled by the parameters WALL_TAPERED_EXTERIOR_INWARD_ANGLE and WALL_TAPERED_INTERIOR_INWARD_ANGLE.
See Also
Autodesk.Revit.DB Namespace